# ReferenceOtherViewUiRefView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceOtherViewUiRefView Property
ParameterTypeId Class See Also
---
"Reference View": This is used by the UI to allow selection of view reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceOtherViewUiRefView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceOtherViewUiRefView As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceOtherViewUiRefView {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace